{
    "aboutInfo":[
        {
            "id" : 1,
            "description" : "<h2>¡Hola! Soy Leonel Castro González</h2>"
        },
        {
            "id" : 2,
            "description" : "Un desarrollador de software apasionado por crear soluciones tecnológicas que marcan la diferencia. Con una sólida formación en ingeniería de sistemas y experiencia en el desarrollo de aplicaciones web y APIs, me especializo en el uso de tecnologías como <strong>React</strong>, <strong>Next.js</strong>, <strong>.NET</strong>, y <strong>SQL Server</strong> para construir productos escalables y eficientes."
        },
        {
            "id" : 3,
            "description" : "Mi enfoque se centra en la colaboración efectiva y la resolución de problemas. Disfruto trabajar en equipo, donde puedo combinar mis habilidades técnicas con mi capacidad para comunicarme claramente y adaptarme a los desafíos del proyecto. He liderado proyectos desde la concepción hasta la implementación, como <strong>estampidacr.com</strong> y <strong>MAS Contractors</strong>, este último desarrollado con <strong>Next.js</strong> y <strong>Tailwind CSS</strong> para ofrecer una experiencia de usuario moderna y profesional."
        },
        {
            "id" : 4,
            "description" : "Me apasiona aprender y mantenerme al día con las últimas tendencias tecnológicas. Siempre estoy buscando oportunidades para crecer profesionalmente y enfrentar nuevos retos que me permitan expandir mis habilidades y contribuir al éxito de proyectos innovadores."
        },
        {
            "id" : 5,
            "description" : "Si estás buscando un desarrollador comprometido y con una mentalidad orientada a resultados, ¡no dudes en contactarme! Estoy emocionado por la posibilidad de colaborar en tu próximo proyecto."
        }
    ],
    "servicios": [
        {
            "id": 1,
            "title": "Página web básica (SPA)",
            "description": "Una página web de una sola aplicación (SPA) con 5-8 secciones, desarrollada con React o Angular.",
            "price": "$300 - $500"
        },
        {
            "id": 2,
            "title": "Página web con múltiples páginas",
            "description": "Una página web con varias páginas y navegación, desarrollada con React o Angular.",
            "price": "$500 - $900"
        },
        {
            "id": 3,
            "title": "Página web + API",
            "description": "Una página web con múltiples páginas y una API personalizada para funcionalidades avanzadas.",
            "price": "$900 - $5000"
        },
        {
            "id": 4,
            "title": "Mantenimiento mensual",
            "description": "Actualizaciones, correcciones y soporte técnico para tu página web.",
            "price": "$20/mes"
        },
        {
            "id": 5,
            "title": "Hosting mensual",
            "description": "Alojamiento de tu página web en servidores rápidos y seguros.",
            "price": "$20/mes"
        },
        {
            "id": 6,
            "title": "Mantenimiento + Hosting",
            "description": "Un paquete combinado que incluye mantenimiento y hosting.",
            "price": "$40/mes"
        }
    ],
    "experiences": [
        {
            "id": 1,
            "title": "Freelancer - Desarrollador Frontend",
            "date": "Oct 2023 - Actualidad",
            "description": [
                "Como desarrollador freelance, he tenido la oportunidad de liderar proyectos desde su concepción hasta su implementación, trabajando directamente con clientes para garantizar que sus necesidades fueran satisfechas de manera eficiente y profesional. Entre los proyectos más destacados se encuentra la modernización del sitio web de Estampida CR, que originalmente estaba desarrollado en WordPress. Migré la plataforma a Next.js, una tecnología más rápida y eficiente, utilizando herramientas como Bootstrap y Mail.js para optimizar tanto el diseño como la funcionalidad. Este cambio no solo mejoró significativamente los tiempos de carga, reduciéndolos de 1-3 segundos a 0.3 segundos, sino que también ofreció una experiencia de usuario más fluida y moderna.",
                "Otro proyecto clave fue el desarrollo del sitio web de MAS Contractors, donde diseñé y desarrollé la página desde cero, basándome únicamente en conversaciones con el cliente. Mi objetivo fue plasmar los ideales de la empresa en un diseño moderno y alineado con los acabados de alta calidad que caracterizan a la compañía. El cliente quedó tan satisfecho con el resultado que actualmente mantiene una suscripción mensual para hosting y mantenimiento básico.",
                "Durante este tiempo, utilicé tecnologías como React.js, Next.js, Tailwind CSS, Bootstrap y SCSS, explorando sus fortalezas y debilidades para adaptarlas a las necesidades específicas de cada proyecto. Además, aprendí a comunicarme de manera efectiva con los clientes, realizando reuniones periódicas para discutir avances, resolver dudas y ajustar detalles del diseño. Este enfoque colaborativo, junto con revisiones finales y un período de soporte post-lanzamiento, aseguró la satisfacción total de los clientes.",
                "Esta experiencia no solo fortaleció mis habilidades técnicas, sino que también me permitió desarrollar una comprensión más profunda de la importancia de elegir la tecnología adecuada para cada proyecto y de cómo una comunicación clara y constante puede marcar la diferencia en el éxito de un producto digital."
            ]
        },
        {
            "id": 2,
            "title": "Geotecnologías S.A. - Analista Programador Junior",
            "date": "Oct 2022 - Oct 2023",
            "description": [
                "Durante mi tiempo en Geotecnologías S.A., formé parte de un equipo multidisciplinario encargado de desarrollar y mantener sistemas críticos para clientes de alto perfil. Una de mis principales responsabilidades fue el procesamiento y cruce de datos provenientes de múltiples fuentes, como bases de datos de ArcGIS y endpoints proporcionados por los clientes. Esto incluyó la creación de tareas programables, secuencias automatizadas y la optimización de procedimientos almacenados en SQL Server para garantizar la integridad y eficiencia de los datos.",
                "Uno de los proyectos más destacados fue el desarrollo de un sistema avanzado para EEGSA, una compañía eléctrica en Guatemala. Este sistema permitía la visualización en tiempo real de la infraestructura eléctrica, incluyendo postes, transformadores, cableado y otros equipos. Además, integraba un mapa interactivo que mostraba las averías reportadas, las casas afectadas y las indemnizaciones correspondientes, así como la ubicación de los vehículos de servicio en tiempo real. Este proyecto fue clave para optimizar la gestión de emergencias y mejorar la experiencia del usuario final.",
                "Aunque no fui responsable de la integración inicial de Esri y ArcGIS, trabajé extensamente con sus APIs, autenticando JWTs y realizando llamados para obtener información crítica. Este proceso me permitió profundizar en el ecosistema de Esri y adaptarme rápidamente a las tecnologías utilizadas en la empresa.",
                "Mi enfoque en la eficiencia y la resolución de problemas me permitió no solo cumplir con mis tareas de manera oportuna, sino también apoyar a mis compañeros en momentos de alta carga de trabajo. Esto ayudó a reducir significativamente la sobrecarga del equipo y a avanzar el proyecto hacia su siguiente etapa. Mi capacidad para implementar soluciones optimizadas, como el uso de expresiones Lambda y LINQ en C#, fue reconocida por mis supervisores, quienes valoraron mi enfoque orientado a la eficiencia.",
                "Esta experiencia no solo fortaleció mis habilidades técnicas, como la implementación de seguridad en APIs REST mediante JWT, sino que también me enseñó a colaborar efectivamente con compañeros que tenían estilos de trabajo diferentes al mío. Aprendí a adaptarme a nuevas tecnologías y metodologías, lo que me permitió contribuir de manera significativa al éxito del equipo y del proyecto."
            ]
        },
        {
            "id": 3,
            "title": "Nea:Coding - Desarrollador Junior",
            "date": "Abr 2022 - Sep 2022",
            "description": [
                "En mi primer rol profesional como desarrollador, tuve la oportunidad de trabajar en el desarrollo de una aplicación frontend utilizando Angular 13. Este proyecto consistía en la creación de un sistema para generar logos personalizados para diferentes departamentos de una organización. Aprovechando las propiedades de Angular, implementé la comunicación entre componentes padre e hijo para mostrar una vista previa en tiempo real del resultado final mientras el usuario navegaba por la página. El sistema realizaba llamados a una API que transformaba los logos en múltiples formatos, como PNG, JPG, TIF y YMD.",
                "Durante este tiempo, trabajé con tecnologías como .NET Core, Angular, C#, SQL Server, y herramientas de control de versiones como Git y TFS. Estas tecnologías fueron fundamentales para garantizar la funcionalidad y eficiencia del sistema, cumpliendo con todos los requerimientos del cliente.",
                "Uno de los mayores desafíos que enfrenté fue adaptarme rápidamente a las exigencias del entorno profesional, ya que recién había salido de la universidad. Esto implicó aprender desde cero conceptos avanzados como expresiones Lambda, operaciones ternarias, principios SOLID, y la implementación de pruebas unitarias e integradas. Dediqué largas horas fuera del trabajo para estudiar y alcanzar el nivel requerido, logrando en tres meses dominar las habilidades necesarias para cumplir con las tareas asignadas.",
                "Trabajé en equipo junto a un programador senior, y nuestras tareas se gestionaban a través de un sistema de tickets. Cada ticket completado pasaba por un proceso de revisión por parte de QA para garantizar que cumpliera con los estándares de diseño y funcionalidad. Este enfoque colaborativo me permitió aprender de profesionales experimentados y mejorar mis habilidades técnicas y de comunicación.",
                "Uno de los momentos más gratificantes de esta experiencia fue cuando mi código fue revisado por un arquitecto con más de 45 años de experiencia en programación. El código, que debía cumplir con un 95% de cobertura en pruebas, utilizar inyección de dependencias y validar todas las entradas y salidas, pasó la revisión sin necesidad de correcciones. Este reconocimiento fue un hito en mi carrera, demostrando que mi esfuerzo y dedicación habían dado frutos.",
                "Esta experiencia no solo fortaleció mis habilidades técnicas, sino que también me enseñó la importancia de la disciplina, el aprendizaje continuo y la búsqueda de la excelencia en cada tarea. Fue un período de crecimiento acelerado que sentó las bases para mi desarrollo profesional."
            ]
        }
    ],
    "sidebarLinks": [
        {
            "id": 1,
            "title": "Homepage"
        },
        {
            "id": 2,
            "title": "Services"
        },
        {
            "id": 3,
            "title": "Protafolio"
        },
        {
            "id": 4,
            "title": "About"
        },
        {
            "id": 5,
            "title": "Donation"
        },
        {
            "id": 6,
            "title": "Contact"
        }
    ],
    "logos": [
        {
            "id": 1,
            "img": "/techLogos/Amazon Web Services_dark.svg"
        },
        {
            "id": 2,
            "img": "/techLogos/angular.svg"
        },
        {
            "id": 3,
            "img": "/techLogos/azure.svg"
        },
        {
            "id": 4,
            "img": "/techLogos/bootstrap.svg"
        },
        {
            "id": 5,
            "img": "/techLogos/cloudflare.svg"
        },
        {
            "id": 6,
            "img": "/techLogos/csharp.svg"
        },
        {
            "id": 7,
            "img": "/techLogos/css_old.svg"
        },
        {
            "id": 8,
            "img": "/techLogos/figma.svg"
        },
        {
            "id": 9,
            "img": "/techLogos/firebase.svg"
        },
        {
            "id": 10,
            "img": "/techLogos/Github_dark.svg"
        },
        {
            "id": 11,
            "img": "/techLogos/gitlab.svg"
        },
        {
            "id": 12,
            "img": "/techLogos/Google_Colaboratory.svg"
        },
        {
            "id": 13,
            "img": "/techLogos/jwt.svg"
        },
        {
            "id": 14,
            "img": "/techLogos/kotlin.svg"
        },
        {
            "id": 15,
            "img": "/techLogos/mysql.svg"
        },
        {
            "id": 16,
            "img": "/techLogos/netlify.svg"
        },
        {
            "id": 17,
            "img": "/techLogos/nextjs_icon_dark.svg"
        },
        {
            "id": 18,
            "img": "/techLogos/nodejs.svg"
        },
        {
            "id": 19,
            "img": "/techLogos/Php_dark.svg"
        },
        {
            "id": 20,
            "img": "/techLogos/postman.svg"
        },
        {
            "id": 21,
            "img": "/techLogos/python.svg"
        },
        {
            "id": 22,
            "img": "/techLogos/react.svg"
        },
        {
            "id": 23,
            "img": "/techLogos/sqlite.svg"
        },
        {
            "id": 24,
            "img": "/techLogos/sql-server.svg"
        },
        {
            "id": 25,
            "img": "/techLogos/stripe.svg"
        },
        {
            "id": 26,
            "img": "/techLogos/swagger.svg"
        },
        {
            "id": 27,
            "img": "/techLogos/tailwindcss.svg"
        },
        {
            "id": 28,
            "img": "/techLogos/typescript.svg"
        },
        {
            "id": 29,
            "img": "/techLogos/Unity_dark.svg"
        },
        {
            "id": 30,
            "img": "/techLogos/Vercel_dark.svg"
        },
        {
            "id": 31,
            "img": "/techLogos/visual-studio.svg"
        },
        {
            "id": 32,
            "img": "/techLogos/vitejs.svg"
        },
        {
            "id": 33,
            "img": "/techLogos/vscode.svg"
        },
        {
            "id": 34,
            "img": "/techLogos/wordpress.svg"
        }
    ]
}